docs/2015/gnupack-cygwin-cron-rsync.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2021-08-31 Tue 11:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Windows で cron + rsync でフルバックアップ</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="clothoid" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Windows で cron + rsync でフルバックアップ</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org94a40cc">1. 環境</a></li>
<li><a href="#org946ebc9">2. 手順</a></li>
<li><a href="#orgd11d479">3. 参考</a></li>
</ul>
</div>
</div>


<div id="outline-container-org94a40cc" class="outline-2">
<h2 id="org94a40cc"><span class="section-number-2">1</span> 環境</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Windows 7 64bit</li>
<li>gnupack<sub>devel</sub>-13.06-2015.11.08</li>
</ul>
</div>
</div>
<div id="outline-container-org946ebc9" class="outline-2">
<h2 id="org946ebc9"><span class="section-number-2">2</span> 手順</h2>
<div class="outline-text-2" id="text-2">
<p>
cron をサービスとして登録し、毎朝 4 時に / (ルート)から、/f/backup-cron/ へフルバックアップを行う。
</p>
<pre class="example">
$ apt-cyg install cron cygrunsrv
$ cron-config
The cron daemon can run as a service or as a job. The latter is not recommended.
Cron is already installed as a service under account .\cyg_server.
Installation path: E:\gnupack_devel-13.05-2015.07.19\app\cygwin\cygwin is not for this instance of Cygwin.
You must remove and reinstall the service to run in this instance.
Do you want to remove or reinstall it? (yes/no) yes
OK. The cron service was removed.

Do you want to install the cron daemon as a service? (yes/no) yes
Enter the value of CYGWIN for the daemon: [ ] 

You must decide under what account the cron daemon will run.
If you are the only user on this machine, the daemon can run as yourself.
   This gives access to all network drives but only allows you as user.
To run multiple users, cron must change user context without knowing
  the passwords. There are three methods to do that, as explained in
  http://cygwin.com/cygwin-ug-net/ntsec.html#ntsec-nopasswd1
If all the cron users have executed "passwd -R" (see man passwd),
  which provides access to network drives, or if you are using the
  cyglsa package, then cron should run under the local system account.
Otherwise you need to have or to create a privileged account.
  This script will help you do so.
Do you want the cron daemon to run as yourself? (yes/no) yes

Running cron_diagnose ...
WARNING: You do not currently have a crontab file.

... no problem found.

Do you want to start the cron daemon as a service now? (yes/no) yes
OK. The cron daemon is now running.

In case of problem, examine the log file for cron,
/var/log/cron.log, and the Windows event log (using /usr/bin/cronevents)
for information about the problem cron is having.

Examine also any cron.log file in the HOME directory
(or the file specified in MAILTO) and cron related files in /tmp.

If you cannot fix the problem, then report it to cygwin@cygwin.com.
Please run the script /usr/bin/cronbug and ATTACH its output
(the file cronbug.txt) to your e-mail.

WARNING: PATH may be set differently under cron than in interactive shells.
         Names such as "find" and "date" may refer to Windows programs.

$ cygrunsrv -Q cron
Service             : cron                
Display name        : Cron daemon
Current State       : Running
Controls Accepted   : Stop
Command             : /usr/sbin/cron -n
$ export EDITOR='emacs -Q -nw'
$ crontab -e
$ cat /var/cron/tabs/username
# DO NOT EDIT THIS FILE - edit the master and reinstall.
# (/tmp/crontab.TBl0oMz2r6 installed on Thu Nov 12 13:46:27 2015)
# (Cron version V5.0 -- $Id: crontab.c,v 1.12 2004/01/23 18:56:42 vixie Exp $)
0 4 * * * username rsync -xa --delete / /f/backup-cron
$ cygrunsrv --stop cron
$ cygrunsrv --start cron
$ cygrunsrv --query cron
Service             : cron                
Display name        : Cron daemon
Current State       : Running
Controls Accepted   : Stop
Command             : /usr/sbin/cron -n
</pre>
</div>
</div>
<div id="outline-container-orgd11d479" class="outline-2">
<h2 id="orgd11d479"><span class="section-number-2">3</span> 参考</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Cygwin で cron を使うときのメモ
<a href="http://d.hatena.ne.jp/kkobayashi_a/20080605/p1">http://d.hatena.ne.jp/kkobayashi_a/20080605/p1</a></li>
<li>Cygwin で cron を使うときのメモその 2
<a href="http://d.hatena.ne.jp/kkobayashi_a/20150717/p1">http://d.hatena.ne.jp/kkobayashi_a/20150717/p1</a></li>
<li>Windows で Cygwin を使って cron する
<a href="http://hitorisu.hatenablog.jp/entry/2012/08/10/183612">http://hitorisu.hatenablog.jp/entry/2012/08/10/183612</a></li>
<li>cygwin で cron を動かすには
<a href="http://blog.enjoitech.com/article/218">http://blog.enjoitech.com/article/218</a></li>
<li>[cygwin] cygwin の cron で定期処理してみる
<a href="http://d.hatena.ne.jp/poqute/20070307/p1">http://d.hatena.ne.jp/poqute/20070307/p1</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2021-08-31 Tue 11:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
